areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_adcregs.h
/* Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 */

/**
 * @file    p33c_adcregs.h
 * @see     p33c_adc.h, p33c_adc-d.h
 * @brief   Analog-To-Digital Converter (ADC) peripheral module register inheritance declarations
 * @author  M91406
 */

// This is a guard condition so that contents of this file are not included
// more than once.  
#ifndef P33C_HSADC_SFR_INHERITANCE_H
#define P33C_HSADC_SFR_INHERITANCE_H

#include <xc.h> // include processor files - each processor file is guarded.  
#include <stdint.h> // include standard integer types header file
#include <stdbool.h> // include standard boolean types header file

#include "p33c_devices.h" // include SMPS device family abstraction declarations

// GENERIC ADC PERIPHERAL MODULE SPECIAL FUNCTION REGISTER SET
#ifndef P33C_ADC_s

    /***********************************************************************************
     * @addtogroup  p33c-pral-adc-module-inheritance
     * @extends     P33C_ADC_MODULE_s 
     * @{
     */
    /** 
     * @brief   ADC Module Control Register 1 (Low) inherited from device header file
     */
    union ADCON1L_u {
        struct tagADCON1LBITS bits;             ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCON1L) ADC CONTROL 1 REGISTER LOW
    
    /** 
     * @brief   ADC Module Control Register 1 (High) inherited from device header file
     */
    union ADCON1H_u {
        struct tagADCON1HBITS bits;             ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCON1H) ADC CONTROL 1 REGISTER HIGH

     /** 
     * @brief   ADC Module Control Register 2 (Low) inherited from device header file
     */
    union ADCON2L_u {
        struct tagADCON2LBITS bits;             ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCON2L) ADC CONTROL 2 REGISTER LOW
    
    /** 
     * @brief   ADC Module Control Register 2 (High) inherited from device header file
     */
    union ADCON2H_u {
        struct tagADCON2HBITS bits;             ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCON2H) ADC CONTROL 2 REGISTER HIGH

     /** 
     * @brief   ADC Module Control Register 3 (Low) inherited from device header file
     */
    union ADCON3L_u {
        struct tagADCON3LBITS bits;             ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCON3L) ADC CONTROL 3 REGISTER LOW
    
    /** 
     * @brief   ADC Module Control Register 3 (High) inherited from device header file
     */
    union ADCON3H_u {
        struct tagADCON3HBITS bits;             ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCON3H) ADC CONTROL 3 REGISTER HIGH

     /** 
     * @brief   ADC Module Control Register 4 (Low) inherited from device header file
     */
    union ADCON4L_u {
        #ifdef tagADCON4LBITS
        struct tagADCON4LBITS bits;             ///< Register bit-field
        #else
        uint16_t : 16;                          ///< (unimplemented)
        #endif
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCON4L) ADC CONTROL 4 REGISTER LOW
    
    /** 
     * @brief   ADC Module Control Register 4 (High) inherited from device header file
     */
    union ADCON4H_u {
        #ifdef tagADCON4HBITS
        struct tagADCON4HBITS bits;             ///< Register bit-field
        #else
        uint16_t : 16;                          ///< (unimplemented)
        #endif
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCON4H) ADC CONTROL 4 REGISTER HIGH

     /** 
     * @brief   ADC Module Control Register 5 (Low) inherited from device header file
     */
    union ADCON5L_u {
        struct tagADCON5LBITS bits;             ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCON5L) ADC CONTROL 5 REGISTER LOW
    
    /** 
     * @brief   ADC Module Control Register 5 (High) inherited from device header file
     */
    union ADCON5H_u {
        #ifdef tagADCON5HBITS
        struct tagADCON5HBITS bits;             ///< Register bit-field
        #else
        uint16_t : 16;                          ///< (unimplemented)
        #endif
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCON5H) ADC CONTROL 5 REGISTER HIGH

    /** 
     * @brief   ADC Input Mode Control Register (Low/High) inherited from device header file
     */
    union ADMOD_u {
        struct {
            uint16_t ADMOD : 16;
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADMODxL/H) ADC INPUT MODE CONTROL REGISTER LOW/HIGH

    /** 
     * @brief   ADC Input Level Sensitive Trigger Control Register (Low/High) inherited from device header file
     */
    union ADLVLTRG_u {
        struct { 
            uint16_t ADLVLTRG : 16; 
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADLVLTRGL/H) ADC LEVEL-SENSITIVE TRIGGER CONTROL REGISTER LOW/HIGH

    /** 
     * @brief   ADC Input Interrupt Enable Register (Low/High) inherited from device header file
     */
    union ADIE_u {
        struct {
            uint16_t ADIE : 16;
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADIEL/H) ADC INTERRUPT ENABLE REGISTER LOW/HIGH

    /** 
     * @brief   ADC Input Data Ready Status Register (Low/High) inherited from device header file
     */
    union ADSTAT_u {
        struct {
            uint16_t ADSTAT : 16;
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADSTATL/H) ADC DATA READY STATUS REGISTER LOW/HIGH

    /** 
     * @brief   ADC Input Early Interrupt Enable Register (Low/High) inherited from device header file
     */
    union ADEIE_u {
        struct {
            uint16_t ADEIE : 16;
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADEIEL/H) ADC EARLY INTERRUPT ENABLE REGISTER LOW/HIGH

    /** 
     * @brief   ADC Input Early Interrupt Status Register (Low/High) inherited from device header file
     */
    union ADEISTAT_u {
        struct {
            uint16_t ADEISTAT : 16;
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADEISTATL/H) ADC EARLY INTERRUPT STATUS REGISTER LOW/HIGH

    /** 
     * @brief   ADC Input Trigger Selection Register (Low/High) inherited from device header file
     */
    union ADTRIG_u {
        struct { 
            uint8_t ADTRIGxEVEN;                ///< ADC Input Trigger of even ADC input index of this register group
            uint8_t ADTRIGxODD;                 ///< ADC Input Trigger of odd ADC input number of this register group
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADTRIGxL/H) ADC EVEN/ODD CHANNEL TRIGGER SELECTION REGISTER LOW/HIGH

    /** 
     * @brief   ADC Input Conversion Result Buffer Register (Low/High) inherited from device header file
     */
    union ADCBUF_u {
        struct {
            uint16_t ADCBUF : 16;
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCBUFx) ADC CHANNEL CONVERSION RESULT BUFFER REGISTER

    
    /*********************************************************************************/
    /*********************************************************************************/

    /** 
     * @brief   Dedicated ADC Core x Control Register LOW
     */
    union ADCORExL_u {
        #ifdef ADCORE0L
        struct tagADCORE0LBITS bits;            ///< Register bit-field
        #else
        uint16_t : 16;                          ///< (unimplemented)
        #endif
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCORExL) DEDICATED ADC CORE x CONTROL REGISTER LOW
    
    /** 
     * @brief   Dedicated ADC Core x Control Register HIGH
     */
    union ADCORExH_u {
        #ifdef ADCORE0H
        struct tagADCORE0HBITS bits;            ///< Register bit-field
        #else
        uint16_t : 16;                          ///< (unimplemented)
        #endif
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCORExH) DEDICATED ADC CORE x CONTROL REGISTER HIGH
    
    /*********************************************************************************/
    /*********************************************************************************/

    /** 
     * @brief   ADC Digital Comparator x Channel Enable Register
     */
    union ADCMPxEN_u {
        struct {
            uint16_t ADCMPxEN : 16;
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCMPxENL/H) ADC DIGITAL COMPARATOR x CHANNEL ENABLE REGISTER LOW/HIGH

    /** 
     * @brief   ADC Digital Comparator x Threshold Register
     */
    union ADCMPxTHLD_u {
        struct {
            uint16_t ADCMPxTHLD : 16;
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCMPxTHLD) ADC DIGITAL COMPARATOR x THRESHOLD REGISTER

    /** 
     * @brief   ADC Digital Comparator x Control Register
     */
    union ADCMPxCON_u {
        struct tagADCMP0CONBITS bits;           ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADCMPxCON) ADC DIGITAL COMPARATOR x CONTROL REGISTER

    /*********************************************************************************/
    /*********************************************************************************/

    /** 
     * @brief   ADC Digital Filter x Result Register
     */
    union ADFLxDAT_u {
        struct {
            uint16_t DATA : 16;
        } bits;                                 ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADFLxDAT) ADC DIGITAL FILTER x RESULT REGISTER
    
    /** 
     * @brief   ADC Digital Filter x Control Register
     */
    union ADFLxCON_u {
        struct tagADFL0CONBITS bits;            ///< Register bit-field
        uint16_t value;                         ///< 16-bit wide register value
    } __attribute__((packed));                  ///< (ADFLxCON) ADC DIGITAL FILTER x CONTROL REGISTER
    
    /*********************************************************************************/
    /*********************************************************************************/

    /** @} */ // end of inheritance declarations **************************************

    typedef union ADCON1L_u ADCON1L_t;  ///< (ADCON1L) ADC CONTROL 1 REGISTER LOW data type
    typedef union ADCON1H_u ADCON1H_t;  ///< (ADCON1H) ADC CONTROL 1 REGISTER HIGH data type
    typedef union ADCON2L_u ADCON2L_t;  ///< (ADCON2L) ADC CONTROL 2 REGISTER LOW data type
    typedef union ADCON2H_u ADCON2H_t;  ///< (ADCON2H) ADC CONTROL 2 REGISTER HIGH data type
    typedef union ADCON3L_u ADCON3L_t;  ///< (ADCON3L) ADC CONTROL 3 REGISTER LOW data type
    typedef union ADCON3H_u ADCON3H_t;  ///< (ADCON3H) ADC CONTROL 3 REGISTER HIGH data type
    typedef union ADCON4L_u ADCON4L_t;  ///< (ADCON4L) ADC CONTROL 4 REGISTER LOW data type
    typedef union ADCON4H_u ADCON4H_t;  ///< (ADCON4H) ADC CONTROL 4 REGISTER HIGH data type
    typedef union ADCON5L_u ADCON5L_t;  ///< (ADCON5L) ADC CONTROL 5 REGISTER LOW data type
    typedef union ADCON5H_u ADCON5H_t;  ///< (ADCON5H) ADC CONTROL 5 REGISTER HIGH data type
    
    typedef union ADMOD_u   ADMOD_t;    ///< (ADMOD) ADC INPUT MODE CONTROL REGISTER data type
    typedef union ADIE_u    ADIE_t;     ///< (ADIE)  ADC INPUT INTERRUPT ENABLE REGISTER data type
    typedef union ADSTAT_u  ADSTAT_t;   ///< (ADSTAT) ADC DATA READY STATUS REGISTER  data type
    typedef union ADEIE_u   ADEIE_t;    ///< (ADEIE) ADC INPUT EARLY INTERRUPT ENABLE REGISTER data type
    typedef union ADEISTAT_u ADEISTAT_t; ///< (ADEISTAT) ADC EARLY INTERRUPT STATUS REGISTER data type
    typedef union ADTRIG_u  ADTRIG_t;   ///< (ADTRIG)  ADC EVEN/ODD CHANNEL TRIGGER SELECTION REGISTER data type
    typedef union ADCBUF_u  ADCBUF_t;   ///< (ADCBUF)  ADC CHANNEL CONVERSION RESULT BUFFER REGISTER data type
    typedef union ADLVLTRG_u ADLVLTRG_t; ///< (ADLVLTRG) ADC LEVEL-SENSITIVE TRIGGER CONTROL REGISTER data type
    
    typedef union ADCMPxEN_u ADCMPxEN_t;  ///< (ADCMPxEN) ADC DIGITAL COMPARATOR x CHANNEL ENABLE REGISTER data type
    typedef union ADCMPxTHLD_u ADCMPxTHLD_t;  ///< (ADCMPxTHLD) ADC DIGITAL COMPARATOR x COMPAPRE THRESHOLD REGISTER data type
    typedef union ADCMPxTHLD_u ADCMPxLO_t;  ///< (ADCMPxLO) ADC DIGITAL COMPARATOR x COMPAPRE LOW THRESHOLD REGISTER data type
    typedef union ADCMPxTHLD_u ADCMPxHI_t;  ///< (ADCMPxHI) ADC DIGITAL COMPARATOR x COMPAPRE HIGH THRESHOLD REGISTER data type
    typedef union ADCMPxCON_u  ADCMPxCON_t; ///< (ADCMPxCON) ADC DIGITAL COMPARATOR x CONTROL REGISTER data type

